#+TITLE: Lecture 11

** NBANDS
You need enough bands so that the highest energy bands are unoccupied

- Example of not enough bands
#+BEGIN_SRC python :results output
from jasp import *
from ase import Atom, Atoms

atoms = Atoms([Atom('Cu',  [0.000,      0.000,      0.000])],
              cell=  [[ 1.818,  0.000,  1.818],
                      [ 1.818,  1.818,  0.000],
                      [ 0.000,  1.818,  1.818]])

with jasp('cu-setnbands',
          xc='PBE',
          encut=350,
          kpts=(13,13,13),
          sigma=0.4,
          nbands=6,
          atoms=atoms) as calc:
    print atoms.get_potential_energy()

#+END_SRC

#+RESULTS:
: Errors found:
: 2061: |      Your highest band is occupied at some k-points! Unless you are         |
:
:
: -3.723563

This is what appears in the [[./cu-setnbands/OUTCAR::2061]]

#+begin_example
 -----------------------------------------------------------------------------
|                                                                             |
|  ADVICE TO THIS USER RUNNING 'VASP/VAMP'   (HEAR YOUR MASTER'S VOICE ...):  |
|                                                                             |
|      Your highest band is occupied at some k-points! Unless you are         |
|      performing a calculation for an insulator or semiconductor, without    |
|      unoccupied bands, you have included TOO FEW BANDS!! Please increase    |
|      the parameter NBANDS in file 'INCAR' to ensure that the highest band   |
|      is unoccupied at all k-points. It is always recommended to             |
|      include a few unoccupied bands to accelerate the convergence of        |
|      molecular dynamics runs (even for insulators or semiconductors).       |
|      Because the presence of unoccupied bands improves wavefunction         |
|      prediction, and helps to suppress 'band-crossings.'                    |
|      Following all k-points will be listed (with the Fermi weights of       |
|      the highest band given in paranthesis) ... :                           |
|                                                                             |
|                          6       (-0.01472)                                 |
|                          8       (-0.01413)                                 |
|                         13       (-0.01733)                                 |
|                         14       (-0.01838)                                 |
|                                                                             |
|      The total occupancy of band no.    49 is  -0.00932 electrons ...       |
|                                                                             |
 -----------------------------------------------------------------------------
#+end_example

The default behavior for setting nbands in VASP is:

| non-spin polarized | NELECT/2 + NIONS/2    |
| spin-polarized     | 0.6*NELECT + NMAGIONS |


- You need to know the number of valence electrons
- The valence electrons are stored in the second line of the element POTCAR
- Different POTCARs for the same element may have different electrons
#+BEGIN_SRC sh
head -n 2 $VASP_PP_PATH/POTPAW_PBE/Ag/POTCAR
head -n 2 $VASP_PP_PATH/POTPAW_PBE/Ag_pv/POTCAR
#+END_SRC

#+RESULTS:
:  PAW_PBE Ag 06Sep2000
:  11.0000000000000000
:   PAW_PBE Ag_pv 09Dec2005
:  17.0000000000000000

- Helpful functions for setting NBANDS
 -  func:jasp.get_valence_electrons
 -  func:jasp.set_nbands


